<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img
 src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/alx-courses/aice/assets/Content_page_banner_blue_dots.png"
 alt="ALX Content Header"
 class="full-width-image"
/>
</div>

# The Third Normal Form – 3NF

In this train, we will cover the concept of the Third Normal Form (3NF) in database design, emphasising the elimination of transitive partial dependencies by creating separate tables for related attributes.

> ⚠️ This notebook will not run on Google Colab because it cannot connect to a local database. Please make sure that this notebook is running on the same local machine as your MySQL Workbench installation and MySQL `company_data` database.

## Learning objectives

In this train, we will learn to:
- Understand the criteria for a table to meet the Third Normal Form (3NF) in database design.
- Identify and eliminate transitive partial dependencies by creating separate tables for related attributes.

## Connecting to the database

Using our `Company_employees` table in our `company_data` database that was created in MySQL Workbench, we want to answer some questions about our dataset. We can apply the same queries we used in MySQL Workbench in this notebook if we connect to our MySQL server by running the cells below.

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

In [4]:
# Establish a connection to the local database using the '%sql' magic command.
# Replace 'password' with our connection password and `db_name` with our database name. 
# If you get an error here, please make sure the database name or password is correct.

%sql mysql+pymysql://root:12122001UPi@localhost:3306/company_data

Connecting to 'mysql+pymysql://root:***@localhost:3306/company_data'

## Overview 

When a table is in the Second Normal Form, it eliminates repeating groups and redundancy, but it does not eliminate transitive partial dependency, i.e. a non-key attribute that is dependent on another non-key attribute.

For a table to be in the 3NF, it must both:
- Be in 2NF.
- Have no transitive partial dependency.

To make this more concrete, take a look at the Employees table:

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/2NF%20ERD.png"  style="width:90%";/>
<br>
<br>
    <em>Figure 1: Second Normal Form ERD</em>
</div>

The `Home_state` column in the `Employees` table is dependent on the `State_code` column in the same table. This is an example of transitive partial dependency.

## Exercise

### Exercise 1

Solve the transitive partial dependency by creating a table called `States` from the `Employees` table. It will contain the columns `State_code` and `Home_state`.

In [6]:
%%sql
CREATE TABLE States(PRIMARY KEY(State_code))
SELECT 
    DISTINCT State_code,
    Home_state
FROM
    Employees;

Running query in 'mysql+pymysql://root:***@localhost:3306/company_data'

3 rows affected.

++
||
++
++

In [8]:
%%sql 
SELECT * FROM States;

Running query in 'mysql+pymysql://root:***@localhost:3306/company_data'

3 rows affected.

+------------+------------+
| State_code | Home_state |
+------------+------------+
|     5      |  Nairobi   |
|     26     | Cape Town  |
|     56     |   Joburg   |
+------------+------------+

### Exercise 2

Drop the `Home_state` column from the `Employees` table.

In [9]:
%%sql
ALTER TABLE Employees
DROP COLUMN Home_state;

Running query in 'mysql+pymysql://root:***@localhost:3306/company_data'

++
||
++
++

In [10]:
%%sql
SELECT * FROM Employees;

Running query in 'mysql+pymysql://root:***@localhost:3306/company_data'

3 rows affected.

+-------------+----------+------------+
| Employee_id |   Name   | State_code |
+-------------+----------+------------+
|     E001    |  Carmel  |     26     |
|     E002    | Stefanie |     56     |
|     E003    |   Lisa   |     5      |
+-------------+----------+------------+

## Solutions

### Exercise 1

In [ ]:
%%sql

DROP TABLE IF EXISTS States;

CREATE TABLE States (PRIMARY KEY(`State_code`)) AS
SELECT 
    State_code, 
    Home_state
FROM 
    Employees;

### Exercise 2

In [ ]:
%%sql

ALTER TABLE Employees 
DROP COLUMN Home_state;

### Summary

We have transformed the original table into the Third Normal Form, resulting in this relational structure:

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/3NF%20ERD.png"  style="width:90%";/>
<br>
<br>
    <em>Figure 2: Third Normal Form ERD</em>
</div>

#  

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/refs/heads/master/ALX_banners/ALX_Navy.png"  style="width:100px"  ;/>
</div>